//变量：变量是存储信息的容器，可以存储任何类型的数据。
// 变量声明：如：var a;、var fn=function(){};
// 函数声明：如：function foo(){};
// 函数形参：函数的形参存在于函数作用域中；
// 语言自定义构建：所有的作用域都会自动生成this、arguments两个默认变量


// 1.变量声明
// <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
    // a=2
    // var a;
    // console.log(a)
// <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
    // console.log(a)
    // var a = 2 ;
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


// 2.函数声明
// <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
    // foo();
    // function foo(){
    //     console.log(a);
    //     var a =2;
    // }
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
    // foo();
    // var foo = function bar(){
    //     console.log(a);
    //     var a =2;
    // }
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

// 3.函数声明和变量声明的优先性
// <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
    // foo();
    // var foo;
    // function foo(){
    //     console.log(1)
    // }
    // foo = function(){
    //     console.log(2)
    // }
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

// <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
// var a=1;
// function foo(){
//   a=10;
//   return;
//   function a(){ }
// }
// foo();
// console.log(a);
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<










